In [1]:
import pandas as pd
import numpy as np

In [25]:
data =  {'eng':[10,30,50,70,60],
         'kor':[20,40,60,80,75],
         'math':[90,50,20,70,30]}
df = pd.DataFrame(data, index=['a','b','c','d','e'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [5]:
df+2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72
e   62   77    32

In [7]:
df+df

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140
e  120  150    60

In [ ]:
df + [10,20,30] #브로드 캐스팅으로 확장되어 행열로 더 해짐

   eng  kor  math
a   20   40   120
b   40   60    80
c   60   80    50
d   80  100   100
e   70   95    60

In [ ]:
df['eng'] = df['eng'] + 2 #수정:요소별로 할당되어 수정 됨

In [ ]:
df.loc['a'] = df.loc['a'] + 2 #a행이 기존 값이 2를 더한 값으로 수정됨

In [23]:
df.loc['c':'d','kor':] = df.loc['c':'d','kor':] + 2

## boolean indexing
- 행단위: [[True,False,...]]

In [28]:
df[[True,False,False,True,True]]

   eng  kor  math
a   10   20    90
d   70   80    70
e   60   75    30

In [33]:
df['eng'] >30

a    False
b    False
c     True
d     True
e     True
Name: eng, dtype: bool

In [ ]:
df[df['eng'] >30] #df[[False,False,True,True,True]]

   eng  kor  math
c   50   60    20
d   70   80    70
e   60   75    30

In [ ]:
df[ (df['eng'] == 30) | (df['eng'] == 70) ] # 영어 점수가 30 또는 70인 행

   eng  kor  math
b   30   40    50
d   70   80    70

In [ ]:
df[df['eng'].isin([30,70])] # 위 값과 동일

   eng  kor  math
b   30   40    50
d   70   80    70

In [ ]:
df['eng']

In [42]:
df[(df['eng'] >= 30) & (df['eng'] <= 70)]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [ ]:
df[ df['eng'].between(30,70) ]

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

### query 멤버 함수

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.query.html

In [46]:
df.query('eng>=30')

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [48]:
df.query('eng==30 or eng==70')

   eng  kor  math
b   30   40    50
d   70   80    70

In [51]:
df.query('eng>=30 and eng<=70')

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [52]:
df.query('30 <= eng <=70')

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [57]:
n = 30
# df[ df['eng'] > n ]
# df.query(f'eng>={n}')
df.query( 'eng>=@n')

   eng  kor  math
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30

In [40]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70
e   60   75    30